{
  "github": "GitHub",
  "read-more": "Lire plus",
  "restaurant-gare": {
    "description": "Les gérants du restaurant de la gare de Corcelles-Peseux ont désiré un site web pour présenter leur établissement, ainsi que leur carte, le menu de la semaine et les suggestions du moment. Ils ont également souhaité pouvoir mettre à jour leur menu de la semaine et les suggestions de manière autonome, sans devoir passer par un intermédiaire.",
    "specs": "Le projet est composé de deux applications web. La première est le site web public, réalisé avec Angular. La seconde est une simple application PHP, permettant de mettre à jour le menu de la semaine et les suggestions du moment. Cette application PHP sert également de \"mini API\", car elle est appelée par la première application Angular, afin de récupérer les suggestions du moment à afficher.",
    "title": "Restaurant de la Gare"
  },
  "squadbustersfr": {
    "description": "Pour la sortie du jeu mobile SquadBusters, réalisé par Supercell, un créateur m'a contacté afin de réaliser un site web recensant un wiki sur le jeu, ainsi que des articles publiés régulièrement par les créateurs de contenu.",
    "specs": "Le projet se compose d'une WebApi en .NET 8.0, assortie d'une base de données SQL Server. Il existe deux applications clientes, chacune réalisée avec Angular: une partie \"admin\", sécurisée, pour pouvoir ajouter dynamiquement des données et une partie \"publique\", pour les utilisateurs. Afin de lier les deux clients avec l'API, et pour éviter le duplicata de code, une librairie NPM est partagée entre les deux applications.",
    "title": "SquadBusters FR"
  },
  "tech-specs": "Spécifications techniques",
  "title": "Projets",
  "univers-mode": {
    "description": "** En cours de réalisation ** Pour la création de sa boutique en ligne Univers Mode, ma sœur nous a demandé, à mon papa et moi, de réaliser son site web. Elle souhaitait un site simple, épuré, et facile à mettre à jour. Elle souhaitait également pouvoir gérer elle-même les produits, les stocks, les commandes, les clients, etc.",
    "specs": "Le projet est constitué d'une seule application web, réalisée avec Laravel. Cette application est composée de plusieurs parties: une partie \"publique\", pour les clients, et une partie \"admin\", pour les administrateurs. La partie \"admin\" est sécurisée, et permet de gérer les produits, les stocks, les commandes, les clients, etc. La partie \"publique\" permet aux clients de consulter les produits, de les ajouter au panier, de passer commande, etc.",
    "title": "Univers Mode"
  },
  "website": "Site Web"
}
